HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEmem_mpu_bf.h
/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN56 */
#define IFX_EMEM_MPU_ACCEN1_EN56_OFF (24u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN57 */
#define IFX_EMEM_MPU_ACCEN1_EN57_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN57 */
#define IFX_EMEM_MPU_ACCEN1_EN57_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN57 */
#define IFX_EMEM_MPU_ACCEN1_EN57_OFF (25u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN58 */
#define IFX_EMEM_MPU_ACCEN1_EN58_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN58 */
#define IFX_EMEM_MPU_ACCEN1_EN58_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN58 */
#define IFX_EMEM_MPU_ACCEN1_EN58_OFF (26u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN59 */
#define IFX_EMEM_MPU_ACCEN1_EN59_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN59 */
#define IFX_EMEM_MPU_ACCEN1_EN59_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN59 */
#define IFX_EMEM_MPU_ACCEN1_EN59_OFF (27u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN60 */
#define IFX_EMEM_MPU_ACCEN1_EN60_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN60 */
#define IFX_EMEM_MPU_ACCEN1_EN60_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN60 */
#define IFX_EMEM_MPU_ACCEN1_EN60_OFF (28u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN61 */
#define IFX_EMEM_MPU_ACCEN1_EN61_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN61 */
#define IFX_EMEM_MPU_ACCEN1_EN61_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN61 */
#define IFX_EMEM_MPU_ACCEN1_EN61_OFF (29u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN62 */
#define IFX_EMEM_MPU_ACCEN1_EN62_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN62 */
#define IFX_EMEM_MPU_ACCEN1_EN62_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN62 */
#define IFX_EMEM_MPU_ACCEN1_EN62_OFF (30u)

/** \brief Length for Ifx_EMEM_MPU_ACCEN1_Bits.EN63 */
#define IFX_EMEM_MPU_ACCEN1_EN63_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_ACCEN1_Bits.EN63 */
#define IFX_EMEM_MPU_ACCEN1_EN63_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_ACCEN1_Bits.EN63 */
#define IFX_EMEM_MPU_ACCEN1_EN63_OFF (31u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.INTERR */
#define IFX_EMEM_MPU_MEMCON_INTERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.INTERR */
#define IFX_EMEM_MPU_MEMCON_INTERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.INTERR */
#define IFX_EMEM_MPU_MEMCON_INTERR_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.RMWERR */
#define IFX_EMEM_MPU_MEMCON_RMWERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.RMWERR */
#define IFX_EMEM_MPU_MEMCON_RMWERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.RMWERR */
#define IFX_EMEM_MPU_MEMCON_RMWERR_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.DATAERR */
#define IFX_EMEM_MPU_MEMCON_DATAERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.DATAERR */
#define IFX_EMEM_MPU_MEMCON_DATAERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.DATAERR */
#define IFX_EMEM_MPU_MEMCON_DATAERR_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.ADDERR */
#define IFX_EMEM_MPU_MEMCON_ADDERR_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.ADDERR */
#define IFX_EMEM_MPU_MEMCON_ADDERR_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.ADDERR */
#define IFX_EMEM_MPU_MEMCON_ADDERR_OFF (7u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.PMIC */
#define IFX_EMEM_MPU_MEMCON_PMIC_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.PMIC */
#define IFX_EMEM_MPU_MEMCON_PMIC_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.PMIC */
#define IFX_EMEM_MPU_MEMCON_PMIC_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_MPU_MEMCON_ERRDIS_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_MPU_MEMCON_ERRDIS_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_MEMCON_Bits.ERRDIS */
#define IFX_EMEM_MPU_MEMCON_ERRDIS_OFF (9u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.GED */
#define IFX_EMEM_MPU_SCTRL_GED_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.GED */
#define IFX_EMEM_MPU_SCTRL_GED_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.GED */
#define IFX_EMEM_MPU_SCTRL_GED_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.GEC */
#define IFX_EMEM_MPU_SCTRL_GEC_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.GEC */
#define IFX_EMEM_MPU_SCTRL_GEC_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.GEC */
#define IFX_EMEM_MPU_SCTRL_GEC_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.LSEN */
#define IFX_EMEM_MPU_SCTRL_LSEN_LEN (2u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.LSEN */
#define IFX_EMEM_MPU_SCTRL_LSEN_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.LSEN */
#define IFX_EMEM_MPU_SCTRL_LSEN_OFF (8u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.LSTST */
#define IFX_EMEM_MPU_SCTRL_LSTST_LEN (2u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.LSTST */
#define IFX_EMEM_MPU_SCTRL_LSTST_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.LSTST */
#define IFX_EMEM_MPU_SCTRL_LSTST_OFF (10u)

/** \brief Length for Ifx_EMEM_MPU_SCTRL_Bits.LSSTAT */
#define IFX_EMEM_MPU_SCTRL_LSSTAT_LEN (2u)

/** \brief Mask for Ifx_EMEM_MPU_SCTRL_Bits.LSSTAT */
#define IFX_EMEM_MPU_SCTRL_LSSTAT_MSK (0x3u)

/** \brief Offset for Ifx_EMEM_MPU_SCTRL_Bits.LSSTAT */
#define IFX_EMEM_MPU_SCTRL_LSSTAT_OFF (16u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNLA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNLA_ADDR_LEN (27u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNLA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNLA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNLA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNLA_ADDR_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNUA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNUA_ADDR_LEN (27u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNUA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNUA_ADDR_MSK (0x7ffffffu)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNUA_Bits.ADDR */
#define IFX_EMEM_MPU_RGNWRN_RGNUA_ADDR_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN0_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN0_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN0 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN0_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN1_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN1 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN1_MSK (0x1u)

