HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEmem_mpu_bf.h
/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN21 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN21_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN21 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN21_OFF (21u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN22 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN22_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN22 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN22_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN22 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN22_OFF (22u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN23 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN23_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN23 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN23_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN23 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN23_OFF (23u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN24 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN24_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN24 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN24_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN24 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN24_OFF (24u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN25 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN25_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN25 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN25_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN25 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN25_OFF (25u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN26 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN26_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN26 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN26_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN26 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN26_OFF (26u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN27 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN27_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN27 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN27_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN27 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN27_OFF (27u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN28 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN28_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN28 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN28_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN28 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN28_OFF (28u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN29 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN29_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN29 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN29_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN29 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN29_OFF (29u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN30 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN30_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN30 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN30_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN30 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN30_OFF (30u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN31 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN31_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN31 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN31_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWA_Bits.EN31 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWA_EN31_OFF (31u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN32 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN32_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN32 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN32_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN32 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN32_OFF (0u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN33 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN33_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN33 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN33_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN33 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN33_OFF (1u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN34 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN34_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN34 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN34_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN34 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN34_OFF (2u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN35 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN35_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN35 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN35_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN35 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN35_OFF (3u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN36 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN36_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN36 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN36_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN36 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN36_OFF (4u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN37 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN37_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN37 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN37_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN37 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN37_OFF (5u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN38 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN38_LEN (1u)

/** \brief Mask for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN38 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN38_MSK (0x1u)

/** \brief Offset for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN38 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN38_OFF (6u)

/** \brief Length for Ifx_EMEM_MPU_RGNWRN_RGNACCENWB_Bits.EN39 */
#define IFX_EMEM_MPU_RGNWRN_RGNACCENWB_EN39_LEN (1u)

